Repository: JakMir98/BrainWaves
Catalog: BrainWaves/BrainWaves/BrainWaves/Resources/Strings/Resource.*.resx
Languages: pl

# ApplicationNeedPermissionText
source: Appliaction needs perrmission
pl: Aplikacja wymaga zezwolenia

# AutomaticServiceChoosing
source: Automatic service and characteristic choosing
pl: Automatyczne wybieranie serwisu

# BLEData
source: Bluetooth data
pl: Dane modułu bluetooth

# CharacteristicReceiveUUIDLabel
source: Receiving characteristic UUID
pl: UUID charakterystyki odbierania

# CharacteristicSendUUIDLabel
source: Sending characteristic UUID
pl: UUID charakterystyki wysyłania

# Charts
source: Charts t/f
pl: Wykresy

# ConnectText
source: Connect
pl: Połącz

# EmptyText
source: Empty
pl: Pusty

# ErrorConnectingBLE
source: Error connecting to BLE device
pl: Błąd podczas połączenia bluetooth

# ErrorTitle
source: Error
pl: Błąd

source: Find device
pl: Znajdź urządzenie

# LanguageENG
source: English
pl: Angielski

# LanguagePL
source: Polish
pl: Polski

# PerrmisionRequiredTitle
source: Permission required
pl: Zezwolenie wymagane

# ScanButtonText
source: Scan
pl: Wyszukaj

# ServiceUUIDLabel
source: Service UUID
pl: UUID serwisu

source: Settings
pl: Ustawienia

# StopScanningText
source: Stop scanning
pl: Zakończ skanowanie

source: Theme
pl: Motyw

# GoBackText
source: Go back
pl: Cofnij

# BleOff
source: Bluetooth is turned off
pl: Bluetooth jest wyłączony

# BleUnavailable
source: Bluetooth is unavailable
pl: Bluetooth jest niedostępny

# SamplingFreq
source: Sampling frequency
pl: Częstotliwość próbkowania

# TimeToReadMindInMin
source: Time to read data in minutes
pl: Czas pobierania danych w minutach

source: Sample
pl: Próbka

source: Connecting
pl: Łączenie

# ScanningMessage
source: Scanning...
pl: Wyszukiwanie...

# ExportingToExcellMessage
source: Exporting to excell...
pl: Eksportowanie do excella...

# SettingUpChartsMessage
source: Setting up charts...
pl: Konfigurowanie wykresów...

# DisconnectingMessage
source: Disconnecting...
pl: Odłączanie...

# GettingCharacteristicMessage
source: Characteristic dowload...
pl: Pobieranie charakterystyki urządzenia...

# SendingMessage
source: Sending...
pl: Wysyłanie...

# ExcellProcessing
source: Samples processing...
pl: Przetwarzanie próbek...

source: Chart middle point
pl: Środkowy punkt wykresu

source: Enter number
pl: Wprowadź liczbę

# NumberOfSamplesToShow
source: Number of samples to show on chart from the middle point
pl: Ilość pokazywanych próbek na wykresie od środka

# FreqDomain
source: Frequency domain
pl: Dziedzina częstotliwości

source: Time domain
pl: Dziedzina czasu

# ShowFreqDomain
source: Show frequency domain
pl: Pokaż dziedzinę częstotliwości

source: Show time domain
pl: Pokaż dziedzinę czasu

source: Export time samples
pl: Eksportuj próbki w domenie czasu

# ExportFreqSamples
source: Export frequency samples
pl: Eksportuj próbki w domenie częstotliwości

# Freqz
source: Frequencies
pl: Częstotliwości

# GattServiceNotFoundError
source: UART GATT service not found.
pl: Serwis UART GATT nie został znaleziony.

# BleSetupError
source: Configuring BLE adapter resulted in error
pl: Błąd podczas konfigurowania adaptera BLE

# GattInitError
source: GATT Service init failed
pl: Błąd podczas załączania serwisu GATT

# BleCommandSendingError
source: Error sending comand to BLE device
pl: Błąd podczas wysyłania do urządzenia

# BleDisconnectError
source: Error while disconecting ble device
pl: Błąd podczas odłączania się odurządzenia

# SettingUpFreqChartsMessage
source: Setting up frequency charts
pl: Konfigurowanie wykresów częstotliwości...

# CalculateFFT
source: Calculating fft...
pl: Obliczanie fft...

# ShouldCalculateFFT
source: Should calculate FFT on charts load
pl: Czy obliczać FFT podczas ładowania wykresów

# CalculateFFTButtonText
source: Calculate FFT
pl: Oblicz FFT
